# Home Work
# 1 ==========================================================================
'''
for num in range(11):
    print(num**2)

# 2 ==========================================================================
hour = int(input('Который час? '))
for time in range(hour):
    print('Ку-Ку!', time+1, 'раз')
print('Всего кукуха крякнула:', time+1)

# 3 ==========================================================================
total = int(input('Сколько месяцев будем откладывать? '))
sum = 0
for month in range(total):
    sum_one = int(input('Какую сумму отложим в этом месяце? '))
    sum += sum_one
print('Через', total, 'месяцев накопиться сумма:', sum, 'рублей.')
'''
# 4 ==========================================================================
for degrees in range(20):
    print(f'2^{degrees} = {2**degrees}')
# 5 ==========================================================================

# 6 ==========================================================================