# Home Work
# 1 ==========================================================================
'''
for num in range(1, 11):

# 2 ==========================================================================
num_1 = int(input('Введите первое число: '))
num_2 = int(input('Введите второе число: '))
sum = 0
if num_1 > num_2:
    print('Первое число д/б меньше второго!')
else:
    for number in range(num_1, num_2 + 1):
        sum += number
print('Сумма чисел от', num_1,'до', num_2,'равна', sum)
    print(num**3)

# 3 ==========================================================================
num_1 = int(input('Введите первое число: '))
num_2 = int(input('Введите второе число: '))
sum = 0
if num_1 > num_2:
    print('Первое число д/б меньше второго!')
else:
    for number in range(num_1, num_2 + 1):
        if number % 2 ==0:
            sum += number
    print('Сумма всех четных чисел в интервале\nот', num_1,'до', num_2,'равна', sum)

# 4 ==========================================================================
wake_up = int(input('Во сколько проснулся Саша? '))
awake = 0   # awake - бодровствовать
calories = 0
for hour in range(wake_up, 23):
    cal = int(input(f'Сколько калорий Саша съел в {hour} часов? '))
    calories += cal
    if calories > 2000:
        print('Превышено 2000 калорий! Саша заснул ..Z..z..z..')
        break
    awake += 1
print('За день Саша съел', calories,'каллорий.')
print('Саша находился бодрым', awake,'ч.')
'''
# 5.1 ==========================================================================

N = int(input('Введите число: '))
count = 0
for dev in range(1, N + 1):     # devider - делитель
    if (N % dev) == 0:
        count += 1
    # print(f'Число {N}/{dev}={N/dev}')
if count == 2:
    print(f'                         Число {N} - простое!')
else:
    print(f'Число {N} - составное.')
'''
# 5.2 ==========================================================================
total = 0
for N in range(1000,10001):
    count = 0
    for dev in range(1, N+1):       # devider - делитель
        if (N % dev) == 0:          # как только N разделется на dev без остатка 2 раза, то count станет = 2. Время расходуется
            count += 1              # на деление на каждое число из диапазона от 1 до N+1.
    if count == 2:
        total += 1
        print(f'                         Число {N} - простое!')
    else:
        print(f'Число {N} - составное.')
print(f'-----------------------------------------------')
print(f'В рассмотренном диапазоне {total} простых чисел.')
print(f'-----------------------------------------------')
'''