# Task 1

# def myAdress(name):
#     print('Фамилия: Иванов')
#     print('Имя:', name)
#     print('Улица: Пушкина')
#     print('Дом: 32')
#     print()

# myAdress('Василий')
# myAdress('Игорь')
# myAdress('Алена')

# Task 2

# import math

# def func(x):
#     if -5 <= x <= 5:    # Что одно и тоже: x >= -5 and x <= 5:
#         print('x =', x, 'y =', math.exp(x))
#     elif x < -5:
#         print('x =', x, 'y =', 2 * abs(x) - 1)
#     elif x > 5:
#         print('x =', x, 'y =', 2 * x)

# for x in range(-10, 11):
#     func(x)

# Task 3

# Home Work
# 1 ==========================================================================
# def aboutWater(price):
#     # print('Вода КлирВотер от производителя "ВодЗавод" стоит: ', price, 'рублей.\n')
#     print('Название: КлирВотер')
#     print('Производитель: ВодЗавод')
#     print('Цена:', price)
#     print()

# aboutWater(25)
# aboutWater(30)
# aboutWater(40)
# 2 ==========================================================================
# import math

# def sphereArea(R):
#     print('Площадь сферы: ', 4 * math.pi * R ** 2)

# def sphereVolume(R):
#     print('Объём шара', (4 / 3) * math.pi * R ** 3)

# R = float(input('Введите радиус планеты: '))
# sphereArea(R)
# sphereVolume(R)
# 3 ==========================================================================
import math

def function(x):
    if -5 <= x <= 5:
        print('x =', x, 'y =', math.exp(x))
    elif x < 5:
        print('x =', x, 'y =', 2 * abs(x) - 1)
    else:
        print('x =', x, 'y =', 2 * x)

for x in range(-10, 11):
    function(x)
# 4 ==========================================================================
# print('=' * 50)

# def isPrime(num):   # isPrime - простой
#     flag = True
#     for devider in range(2, num):   # devider - делитель
#         if num % devider == 0:
#             flag = False
#             break
#     if flag == True:
#         print('Число', num,'- простое!')
#     else:
#         print('Число', num,'- НЕ простое.')
#     print('-' * 30)

# N = int(input('Введите количество чисел в последовательности: '))
# for number in range(N):
#     print('Введите ' + str(number + 1) + '-е число: ', end = '')
#     num = int(input())
#     isPrime(num)

# print('=' * 50)
# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================