# Task 1

# def myAdress(name, house_number):
#     print('Фамилия: Иванов')
#     print('Имя:', name)
#     print('Улица: Пушкина')
#     print('Дом:', house_number)
#     print()

# myAdress('Василий', 12)
# myAdress('Игорь', 34) 
# myAdress('Алена', 99)

# Task 2
# import math

# def myDistance(x,y):
#     distance = math.sqrt(x ** 2 + y ** 2)
#     print(distance)

# def betweenDistance(x_1, y_1, x_2, y_2):
#     distance = math.sqrt((x_2 - x_1) ** 2 + (y_2 - y_1) ** 2)
#     print(distance)

# choice = int(input('1 - расстояние до точки; 2 - расстояние между двумя точками: '))
# if choice == 1:
#     x = float(input('Введите координату X: '))
#     y = float(input('Введите координату Y: '))
#     myDistance(x, y)
# elif choice == 2:
#     x_1 = float(input('Введите координату X первой точки: '))
#     y_1 = float(input('Введите координату Y первой точки: '))
#     x_2 = float(input('Введите координату X второй точки: '))
#     y_2 = float(input('Введите координату Y второй точки: '))
#     betweenDistance(x_1, y_1, x_2, y_2)
# else:
#     print('Ошибка ввода!')

# Task 3

# Home Work
# 1 ==========================================================================
# # def average_number(a, b):
# #     summ = 0
# #     count = 0
# #     for num in range(a, b + 1):
# #         count += 1
# #         summ += num
# #     aver = summ / count
# #     print('Среднее:', aver)

# def average_number(a, b):
#     aver = (a + b) / 2
#     print('Среднее:', aver)

# a = int(input('Введите левую границу: '))
# b = int(input('Введите правую границу: '))
# if a < b:
#     average_number(a, b)
# else:
#     print('Ошибка ввода!')
# 2 ==========================================================================
# def my_contacts(surname, name, country, city, street, house_number, apartment_number):
#     print('Фамилия:', surname)
#     print('Имя:', name)
#     print('Страна:', country)
#     print('Город:', city)
#     print('Улица:', street)
#     print('Дом:', house_number)
#     print('Квартира:', apartment_number)
#     print()

# my_contacts('Иванов', 'Алексей', 'РФ', 'Москва', 'Красноказарменная', 5, 59)
# my_contacts('Асхабиев', 'Нафис', 'РФ', 'Азнакай', 'Шайхутдинова', 1, 2)
# my_contacts('Алтынбеков', 'Ринат', 'Казахстан', 'Нур', 'Жамала', 6, 765)
# 3 ==========================================================================
import math 

def Distance(x, y):
    dist = math.sqrt(x **2 + y ** 2)
    print('Расстояние от себя до точки: ', dist)

def betweenDistance(x_1, y_1, x_2, y_2):
    dist = math.sqrt((x_2 - x_1) ** 2 + (y_2 - y_1) ** 2)
    print('Расстояние между 2-мя произвольными точками: ', dist)

choice = int(input('1 - найти расстояние от себя до точки; 2 - найти ррасстояние между 2-мя произвольными точками: '))
if choice == 1:
    x = float(input('Введите координату X: '))
    y = float(input('Введите координату Y: '))
    Distance(x, y)
elif choice == 2:
    x_1 = float(input('Введите координату X первой точки: '))
    y_1 = float(input('Введите координату Y первой точки: '))
    x_2 = float(input('Введите координату X второй точки: '))
    y_2 = float(input('Введите координату Y второй точки: '))
    betweenDistance(x_1, y_1, x_2, y_2)
else:
    print('Ошибка ввода!')



# 4 ==========================================================================

# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================