# Task 1



# Task 2



# Task 3



# Home Work
# 1 ==========================================================================
# bet = int(input('Сколько ставим? '))        # bet - ставка
# coef = float(input('Какой коэффициент? '))  # coefficient - коэффициент

# win = round(bet * coef, 2)                  # win - Выигрыш
# print('Потенциальный выигрыш: ', bet * coef)
# print('Потенциальный выигрыш: ', win)
# 2 ==========================================================================
# age = int(input('Введите возраст сына: '))              # age - возраст
# temp = float(input('Введите температуру его тела: '))   # temperature - температура

# present = age * 1.5 * temp                              # present - подарок
# print('Отец подарит сыну денег на день рождения: ', present, 'рублей!')
# 3 ==========================================================================
# print('=' * 50)
# weight = float(input('Введите вес человека в кг: '))        # weight - вес
# height = float(input('Введите рост человека в метрах: '))   # height - рост

# bmi = round(weight / height ** 2, 2)                        # body mass index - индекс массы тела
# if bmi < 18.5:
#     print('У Вас недостаточная масса тела ( Ваш ИМТ =', bmi, ')')
# elif bmi < 25:
#     print('У Вас нормальная масса тела ( Ваш ИМТ =', bmi, ')')
# elif bmi < 30:
#     print('У Вас избыточная масса тела ( Ваш ИМТ =', bmi, ')')
# else:
#     print('Поздравлямпа! У Вас ожирение! ( Ваш ИМТ =', bmi, ')')
# print('=' * 50)
# 4 ==========================================================================
quantity = int(input('Введите количество человек в жюри: ')) # quantity - количество
summ = 0

for num in range(quantity):
    print('Введите оценку', num + 1,'- го члена жюри: ', end = '')
    raiting = float(input())                # raiting - оценка
    while raiting < 0 or raiting > 10:
        raiting = float(input('Неправильный ввод! Балл должен быть положительным и меньше 10!\nПопробуйте еще раз: '))
    summ += raiting
aver_score = round(summ / quantity, 1)      # average score - средний балл
print('Средний балл =', aver_score)
# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================