# Task 1

# while True:
#     force = float(input('Сила удара: '))
#     force *= 10
#     print('Балл: ', int(force))

# Task 2



# Task 3



# Home Work
# 1 ==========================================================================
# chatls = int(input('Сколько у Вас есть чатлов? '))

# price_CR = 2200
# price_ship = 0.5 * price_CR
# print('Это: ', chatls / price_CR,'CR')
# print('Можно купить кораблей: ', int(chatls / price_ship))
# 2 ==========================================================================
# print('Введите местоположение фигуры')
# X = float(input('По горизонтали: '))
# Y = float(input('По вертикали: '))

# if X > 0 and X < 0.8 and Y > 0 and Y < 0.8:
#     X = X / 0.1
#     Y = Y / 0.1
#     print('Фигура находится в клетке: (', end = '')
#     print(int(X), end = ', ')
#     print(int(Y), end = ')')
# else:
#     print('Клетки с такой координатой не существует')
# 3.1 ==========================================================================
# print('=' * 50)
# print('Введите местоположение фигуры')
# horizontal = float(input('По горизонтали: '))
# vertical = float(input('По вертикали: '))

# if horizontal > 0 and horizontal < 0.8 and vertical > 0 and vertical < 0.8:
#     X = int(horizontal / 0.1)
#     Y = int(vertical / 0.1)

#     # delta_X = 0.05 - (horizontal - round(X * 0.1, 2))       # Это почему то странно округляет!
#     # delta_Y = 0.05 - (vertical - round(Y * 0.1, 2))
#     delta_X = round(0.05 - (horizontal - X * 0.1), 3)
#     delta_Y = round(0.05 - (vertical - Y * 0.1), 3)   

#     print('Фигура находится в клетке: (', end = '')
#     print(X, end = ', ')
#     print(Y, end = ')\n')

#     print('Поправьте положение фигуры на (', end = '')
#     print(delta_X, end = ', ')
#     print(delta_Y, end = ')\n')
# else:
#     print('Клетки с такой координатой не существует')
# print('=' * 50)
# 3.2 ==========================================================================
print('=' * 50)
print('Введите местоположение фигуры')
x = float(input('По горизонтали: '))
y = float(input('По вертикали: '))

if x > 0 and x < 0.8 and y > 0 and y < 0.8:
    xSquare = int(x * 10)
    ySquare = int(y * 10)

    # delta_X = 0.05 - (x - xSquare * 0.1)      # Это почему то странно округляет!
    # delta_Y = 0.05 - (y - ySquare * 0.1)
    delta_X = round(0.05 - (x - xSquare * 0.1), 3)
    delta_Y = round(0.05 - (y - ySquare * 0.1), 3)   

    print('Фигура находится в клетке: (', end = '')
    print(xSquare, end = ', ')
    print(ySquare, end = ')\n')

    print('Поправьте положение фигуры на (', end = '')
    print(delta_X, end = ', ')
    print(delta_Y, end = ')\n')
else:
    print('Клетки с такой координатой не существует')
print('=' * 50)
# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================