# Task 1

# import math

# x = int(input('Введите координату x: '))
# y = int(input('Введите координату y: '))

# distance = math.sqrt(x ** 2 + y ** 2)

# print('Расстояние: ', distance)

# Task 2

# import math

# distance = float(input('Введите расстояние до танка: '))
# angle = float(input('Введите угол в градусах: '))

# x = math.cos(angle) * distance
# y = math.sin(angle) * distance
 
# angle /= 57.2958
# x = math.cos(angle) * distance
# y = math.sin(angle) * distance

# print('Координаты танка :', x, ',', y)

# Task 3

# Home Work
# 1 ==========================================================================
# import math

# a = float(input('Введите длину стороны a: '))
# b = float(input('Введите длину стороны b: '))
# c = float(input('Введите длину стороны c: '))

# p = (a + b + c) / 2     # Полупериметр треугольника
# S = math.sqrt(p * (p - a) * (p - b) * (p - c))

# print('Площадь треугольника по формуле Герона равна: ', S)
# 2 ==========================================================================
# import math

# distance = float(input('Расстояние до танка: '))
# angle = float(input('Угол поворота (в градусах): '))

# angle /= 57.2958
# x = round(distance * math.cos(angle), 2)
# y = round(distance * math.sin(angle), 2)

# print('Координаты танка: x =', x, 'y =', y)
# 3 ==========================================================================
# import math

# num = float(input('Введите неотрицательное число для округления: '))

# fract_part = num - int(num) # fractional part - дробная часть
# if fract_part >= 0.5:
#     rounded_num = math.ceil(num)
# else:
#     rounded_num = math.floor(num)
# print('Число после округления: ', rounded_num)
# 4 ==========================================================================
import math

num = float(input('Введите число: '))
num = abs(num)
print()
print('Введенное число: ', num)
print()
print('Округление числа вниз: ', math.floor(num))
print('Округление числа вверх: ', math.ceil(num))
print('Модуль числа: ', abs(num))
print('Квадратный корень числа: ', math.sqrt(num))
print('Экспонента в степени числа: ', math.exp(num))
print('Натуральный логарифм числа: ', math.log(num))
print('Логарифм числа по основанию 2: ', math.log2(num))
print('Логарифм числа по основанию 10: ', math.log10(num))
print('Синус числа: ', math.sin(num))
print('Косинус числа: ', math.cos(num))
if num - int(num) == 0:
    print('Факториал числа: ', math.factorial(int(num)))
# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================