# Task 1

# password = int(input('Введите пароль: '))
# while password != 235:
#     print('Неверный пароль!')
#     password = int(input('Попробуй еще раз: '))
# print('Пароль верный. Добро пожаловать!')

# Task 2

# password = input('Введите пароль: ')
# while password != 'Питон235':
#     print('Неверный пароль!')
#     password = input('Попробуй еще раз: ')
# print('Пароль верный. Добро пожаловать!')

# Task 3

# badGradeCount = 0
# for student in range(5):
#     answer = input('Кто написал произведение? ')
#     if (answer == 'Пушкин') or (answer == 'пушкин'):
#         print('Верно!')
#         break
#     print('Неправильно! Два!')
#     badGradeCount += 1
# print('Кол-во двоек: ', badGradeCount)

# Home Work
# 1 ==========================================================================
# badGradeCount = 0
# for student in range(5):
#     answer = input('Кто написал произведение? ')
#     if (answer == 'Пушкин') or (answer == 'пушкин'):
#         print('Верно!')
#         break
#     print('Неправильно! Два!')
#     badGradeCount += 1
# print('Кол-во двоек: ', badGradeCount)
# 2 ==========================================================================
# answer = input('Ты выполнил ли он задание? ')
# while answer != 'Да, конечно, сделал':
#     answer = input('Ты выполнил ли он задание? ')
# 3 ==========================================================================

# i = 0
# while i < 3:
#     username = input('Как тебя зовут? ')
#     print(username + ', купи слона!')
#     answer = input('')
#     print('Все говорят ' + answer + ', а ты купи слона!')
#     i += 1
# 4 ==========================================================================

# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================