# 1 ==========================================================================
'''
number = int(input('Введите число: '))
summ = 0
while number != 0:
    summ += number
    number = int(input('Введите число: '))
print(summ)

# 2 ==========================================================================
pas = int(input('Введите пароль: '))
num = 1
flag_1 = 0
flag_2 = 0
quality = 7
while pas != 235:
    if num < 3:
        print('Вы ввели неверно пароль: ',num, 'раз.')
        print('Осталось попыток:', quality - num)
        pas = int(input('Попробуйте еще разок: '))
        num += 1
    if flag_1 == 0:
        if num >= 3:
            print('Вы ввели неверно пароль: ',num, 'раз.')
            print('Осталось попыток:', quality - num)
            p = int(input('Хотите получить подсказку? (0-нет/1-да): '))
            if p == 1:
                print('Правильный пароль: 235')
                pas = int(input('Попробуйте еще разок: '))
                flag_1 = 1
                num += 1
            else:
                # print('Вы ввели неверно пароль -',num, 'раза.')
                print('Дело конечно Ваше, но советуем все таки получить додсказку.')
                pas = int(input('Попробуйте еще разок: '))
                
                num += 1
    else:
        print('Разуй глаза! Правильный пароль уже был тебе указан!')
        print('Ты ввел неверно пароль: ',num, 'раз..')
        print('Осталось попыток:', quality - num)
        pas = int(input('Подумай и введи уже пароль правильно: '))
        num += 1
    if pas != 235 and num > 6-1:
        print('Вы ввели неверно пароль: ',num, 'раза.')
        print('Осталось попыток:', quality - num)
        print('===============================================================')
        print('Алё!!! Да ты реально уже заебал! Введи блять в поле пароль: 235')
        print('===============================================================')
        pas = int(input('Подумай и введи уже пароль правильно: '))
        num += 1
    if pas != 235 and num > 7-1:
        print('Осталось попыток:', quality - num)
        print('--------------------------------')
        print('Ну все, иди нахуй Д-А-Л-Б-А-Ё-Б!')
        print('--------------------------------')
        flag_2 = 1 
        break
if num <= 3 and flag_2 != 1:
    print('Пароль верный, добро пожаловать!')
elif num > 3 and flag_2 != 1:
    print('|||||||||||||||||||||||||||||||||||||||||||||||||||||||')
    print('||  Ну наконец то! Я уж думал ты совсем ебанутый...  ||')
    print('|||||||||||||||||||||||||||||||||||||||||||||||||||||||')
else:
    print('|||||||||||||||||||||||||||||||||||||||||||||||')
    print('|| Ты проебал жизнь, можешь убиться об стену!||')
    print('|||||||||||||||||||||||||||||||||||||||||||||||')
inter = int(input('Введи 1 для закрытия окна!'))

# 3 ==========================================================================

wallet = 0
while wallet < 500000:
    salary = int(input('Сколько отложить денег? '))     # salary - зарплата
    wallet += salary
    print(f'В кошельке {wallet} руб.')
# if wallet >= 500000:
print(f'Нужная сумма в {wallet} рублей накоплена!')

# 4 ==========================================================================
wallet = 0
i = 1
ballance = int(input('Введите баланс Вашей карты: '))
while ballance > 3000:
    purchase = int(input(f'Введите сумму {i}-й покупки: '))     # purchase - покупка
    ballance -= purchase
    print(f'Баланс: {ballance} руб.')
    i += 1
print('`````````````````````````````````````````````````````')
print('Внимание: на карте осталось мало денег! Остановитесь!')
print(f'Баланс: {ballance} руб.')
print('`````````````````````````````````````````````````````')
'''
# 5.1 ==========================================================================
number = 0
increment = 7 # Приращение числа
while number < 98:
    number += increment
    print(number)
# 5.2 ==========================================================================
# number = 0
# increment = 7 # Приращение числа
# flag = 0
# while number < (100 - increment):
#     number += increment
#     if flag == 0:
#         numb = str(increment)
#         flag = 1
#     numb = numb + ' ' + str(number)
#     print(number)
# print(numb)
# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================








