# Home Work
# 1 ==========================================================================
#  = int(input('Введите '))
'''
start_num = int(input('Введите с какого числа начать: '))
end_num = int(input('Введите до какого числа считать: '))
degree = int(input('Введите степень числа: '))
while start_num <= end_num:
    print(start_num**degree)
    start_num += 1

# 2 ==========================================================================
seconds = int(input('Введите число секунд: '))
counter = 0
while seconds >= counter:
    print(f'{seconds} c.')
    seconds -= 1

# 3 ==========================================================================
name = input('Введите Ваше имя: ')
stop = True
while stop:
    print(f'Уважаемый {name}! Вы должны ПАО "Сбербанк" - 100000 рублей.')
    sum = int(input('Сколько рублей вы внесёте прямо сейчас, чтобы её погасить? '))
    if sum == 100000:
        print(f'Отлично, {name}! Вы погасили долг. Спасибо!')
        stop = False
    else:
        print(f'Маловато, {name}. Давайте ещё раз.')
print(f'А теперь, {name} можете пиздовать на все четыре стороны!')

# 4.1 ==========================================================================
num = int(input('Введите число: '))
counter = 0
while True:
    remainder = num % 10   # remainder of devision - остаток от деления
    if remainder != 0:
        num //= 10
        counter += 1
    else:
        print('Расчет законцен!')
        break
print(f'В веденном числе {counter} знаков.')

# 4.2.1 ==========================================================================
num = int(input('Введите число: '))
counter = 0
remainder = num % 10   # remainder of devision - остаток от деления
while remainder != 0:
    num //= 10
    counter += 1
    remainder = num % 10
print(f'Расчет законцен!\nВ веденном числе {counter} знаков.')

# 4.2.2 ==========================================================================
num = int(input('Введите число: '))
counter = 0
while (num % 10) != 0:
    num //= 10
    counter += 1
print(f'Расчет законцен!\nВ веденном числе {counter} знаков.')

# 5 ==========================================================================
counter = 0
while True:
    num = int(input('Введите число: '))
    if num == 0:
        break
    elif num % 2 == 0:
        counter += 1
print('Количество введенных четных чисел:', counter)

# 6.1 ==========================================================================
print('\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n')
print('=================================================')
number = int(input('Введите шестизначный номер билета: '))
num = number
count = 0
while (number % 10) != 0:
    count += 1
    number //= 10
if count < 6 or count > 6:
    print('Вы ввели нешестизначный номер билета!\nВведите номер билета правильно!')
    print('=================================================')
else:
    # print(num % 10 + num % 100 // 10 + num % 1000 // 100)
    # print(num // 1000 % 10 + num // 10000 % 10 + num // 100000)
    if (num % 10 + num % 100 // 10 + num % 1000 // 100) == (num // 1000 % 10 + num // 10000 % 10 + num // 100000):
        print('Поздравляем, Ваш билет счастливый!')
        print('=================================================')
    else:
        print('У Вас обычный билет. Попробуйте еще раз.')
        print('=================================================')

# 6.2 ==========================================================================
num = int(input('Введите шестизначный номер билета: '))
if (num % 10 + num % 100 // 10 + num % 1000 // 100) == (num // 1000 % 10 + num // 10000 % 10 + num // 100000):
    print('Поздравляем, Ваш билет счастливый!')
    print('=================================================')
else:
    print('У Вас обычный билет. Попробуйте еще раз.')
    print('=================================================')

# 7 ==========================================================================
a_1 = int(input('Введите первый член прогрессии: '))
d = int(input('Введите разность арифметической прогрессии: '))
n = int(input('Введите количество членов в прогрессии: '))
count = 0
while count < n:
    count += 1 
    print(a_1 + (count-1)*d)
print(((2*a_1  + (count-1)*d)/2)*n) 

# 8 ==========================================================================
print('=========================================================')
Y = int(input('Введите пробег спортсмена: '))
X = int(input('Сколько спортсмен пробежал в первый день? '))
i = 1
print(f'В {i}-й день спортсмен пробежал {X} км.')
while True:
    i += 1
    X = X + X*0.1
    print(f'В {i}-й день спортсмен пробежал {X} км.')
    if X >= Y:
        print('=========================================================')
        print(f'На {i}-й день спортсмен пробежит больше (не менее) {Y} км.')
        break
print('=========================================================')

# 9 ==========================================================================
positive = 0
negative = 0
while True:
    num = int(input('Введите число: '))
    if num == 0:
        break
    elif num < 0:
        negative += 1
    elif num > 0:
        positive += 1
print('Кол-во положительных чисел: ', positive)
print('Кол-во отрицательных чисел: ', negative)

# 10 ==========================================================================
print('=========================================================')
print('Начался 8-часовой рабочий день')
total = 0
count = 0
while count < 8:
    count += 1
    print(f'{count} час')
    num = int(input('Сколько задач решит Максим? '))
    total += num
    telephone = int(input('Звонит жена. Взять трубку? (1/0) '))
    if telephone == 1:
        flag = 1
print('Рабочий день закончился. Всего выполнено задач: ', total)
if flag == 1:
    print('Нужно зайти в магазин.')

# 11 ==========================================================================
t_max = 0
while True:
    t = int(input('Введите значение температуры: '))
    if t == 0:
        break
    elif t > t_max:
        t_max = t
print('Самая высока температура =', t_max)

# 12 ==========================================================================
print('=======================================================================')
x = int(input('Введите сумму вклада: '))
start = x
p = float(input('Введите сумму ежегодного процента: '))
y = int(input('Введите сумму до которой будем копить: '))
print('          ----------------------------------')
print('          |    Год    | Сумма на вкладе, руб.')
print('          ----------------------------------')
count = 0
while True:
    count += 1
    x = x + x*p/100
    print(f'          | {count}-й       | {x} ')
    if x > y:
        break
print('          ----------------------------------')
print('=======================================================================')
print(f'Вклад в {start} рублей достигнет суммы в {y} рублей через {count} лет.')
print('=======================================================================')

# 13 ==========================================================================
print('=======================================================================')
i = 0
while True:
    i += 1
    num = int(input('Загадайте число от 0 до 10: '))
    if num == 7:
        print(f'Вы угадали! Число попыток: {i}')
        break
    elif num > 7:
        print(f'Число больше, чем нужно. Попробуйте ещё раз!')
    elif num < 7:
        print(f'Число меньше, чем нужно. Попробуйте ещё раз!')

# 14.1 ==========================================================================
# Функциям пока не учили, но я просто сделал т.к. уже есть знания от Нетологии
# Этот вариант я выполнил без подсказок, сам
def compare(numm, n_nextt):                      # compare - сравнение
    if num == n_next:
        x = 1
        print(f'{numm} = {n_nextt}')
    elif num > n_next:
        x = 2
        print(f'{numm} > {n_nextt}')
    else:
        x = 3
        print(f'{numm} < {n_nextt}')
    return x
print('====================================================================================')
num = int(input('Загадай число от 1 до 100: '))
print('====================================================================================')
if num > 50:
    n_prev = int(100 / 2)                           # 50 - начальное/опорное значение
    n_next = int(n_prev + (100 - n_prev) / 2)       # 75
else:
    n_prev = int(100 / 2)                           # 50 - начальное/опорное значение
    n_next = int(n_prev - (100 - n_prev) / 2)       # 25
delta = (abs(n_next - n_prev) / 2)                  # 25
i = 0
j = 7
while True:
    i += 1
    print(f'Осталось {j} попыток.')
    print(f'n_prev = {n_prev}  |  n_next = {n_next}  |  delta = {delta}')
    x = int(input(f'Загаданное Вами число равно, больше или меньше, чем {n_next}? (1 — равно, 2 — больше, 3 — меньше): '))
    if num == 50:
        print(f'Ура! Число угадано с {i}-й попытки и равно:', 50)
        print('====================================================================================')
        break 
    # x = compare(num, n_next)
    if n_next % 2 == 0:
        print(f'{n_next} - четное.')
        if x == 2:
            n_prev = n_next
            n_next = int(n_prev + delta)
        elif x == 3:
            n_prev = n_next
            n_next = int(n_next - delta)
        elif x == 1:
            print(f'Ура! Число угадано с {i}-й попытки и равно:', n_next)
            print('====================================================================================')
            break
    else:
        print(f'{n_next} - не четное.')
        # n_next = int(n_next)
        if x == 2:
            n_prev = n_next
            n_next = int(n_prev + delta)
        elif x == 3:
            n_prev = n_next
            n_next = int(n_next - delta)
        elif x == 1:
            print(f'Ура! Число угадано с {i}-й попытки и равно:', n_next)
            print('====================================================================================')
            break
    
    delta = (abs(n_next - n_prev) / 2)

    if delta == 0.5:
        delta = 2*0.5

    # if i > 10:
    #     break

    print('====================================================================================')

    j -= 1
    if j == 0:
        print(f'======================================')
        print(f'Все мужик, ты проебал все {i} попыток, сорян!')
        break

# 14.2 ==========================================================================
# Правильное решение методом бинарного поиска (Решение от SkillBox)
print('===================================================================================================')
i = 0
N_left = 1                                  # 
N_right = 100                               # 
while True:
    i += 1
    N_aver = (N_left + N_right) // 2
    print(f'| {i}-я  п о п ы т к а: Левая граница = {N_left}  |  Середина = {N_aver}  |  Правая граница = {N_right}                |')
    print(f'  ```` ````````````````')
    print(f'|      Твое число равно, больше или меньше, чем {N_aver}?                                               |')
    answer = int(input('|      1 — равно, 2 — больше, 3 — меньше:                                                         |\n                                Ваш ответ - '))
    if answer == 1:
        print(' =================================================================================================')
        print(f'|                                 Ура! Я угадал с {i}-й попытки.                                    |')
        print('|                                ``````````````````````````````                                   |')
        print(' =================================================================================================')
        break
    elif answer == 2:
        N_left = N_aver + 1                 # 
    elif answer == 3:
        N_right = N_aver - 1               # 
    else:
        print('|  Введите ответ по инструкции: 1 — равно, 2 — больше, 3 — меньше!  |')
    print('===================================================================================================')

# 14.3 ==========================================================================
# Редактирование своего варианта на основе правильного решения
print('====================================================================================')
num = int(input('Загадай число от 1 до 100: '))
print('====================================================================================')

n_prev = 1                           # 50 - начальное/опорное значение
n_next = 100
i = 0
j = 7
while True:
    i += 1
    print(f'Осталось {j} попыток.')
    N = (n_next + n_prev) // 2                  # 
    print(f'n_prev = {n_prev}  |  n_next = {n_next}  |  Aver = {N}')
    x = int(input(f'Загаданное Вами число равно, больше или меньше, чем {N}? (1 — равно, 2 — больше, 3 — меньше): ')) 
    if x == 2:
        n_prev = N
        N = (n_next + n_prev) // 2
    elif x == 3:
        n_next = N
        N = (n_next + n_prev) // 2
    elif x == 1:
        print(f'Ура! Число угадано с {i}-й попытки и равно:', n_next)
        print('====================================================================================')
        break
    else:
        print('|  Введите ответ по инструкции: 1 — равно, 2 — больше, 3 — меньше!  |')
    print('====================================================================================')
    j -= 1
    if j == 0:
        print(f'======================================')
        print(f'Все мужик, ты проебал все {i} попыток, сорян!')
        break
'''
# 14.4 ==========================================================================
# Редактирование своего варианта на основе правильного решения
print('====================================================================================')
num = int(input('Загадай число от 1 до 100: '))
print('====================================================================================')
n_prev = 1
n_next = 100
i = 0
j = 7
while True:
    i += 1
    print(f'{i}-я итерация:\n`````````````')
    aver = (n_prev + n_next) // 2        # 50 - начальное/опорное значение
    delta = (abs(aver) // 2)             # 25
    print(f'n_prev = {n_prev}  |  n_next = {n_next}|  aver = {aver}  |  delta = {delta}')
    x = int(input(f'Загаданное Вами число равно, больше или меньше, чем {aver}? (1 — равно, 2 — больше, 3 — меньше): '))
    if x == 2:
        n_prev = aver + 1
    elif x == 3:
        n_next = aver - 1
    elif x == 1:
        print(f'Ура! Число угадано с {i}-й попытки и равно:', aver)
        print('====================================================================================')
        break
    else:
        print(f'Неверное число!')
    print('====================================================================================')





i = 0
N_left = 1                         
N_right = 100  
while True:
    i += 1
    N_aver = (N_left + N_right) // 2
    print(f'Твое число равно, больше или меньше, чем {N_aver}?')
    answer = int(input('1 — равно, 2 — больше, 3 — меньше:'))
    if answer == 1:
        print(f'Я угадал с {i}-й попытки.')
        break
    elif answer == 2:
        N_left = N_aver + 1                 # 
    elif answer == 3:
        N_right = N_aver - 1               # 