'''Работа за преподавателем'''
# Task 1

# N = int(input('Введите размер матрицы: '))
# for row in range(N):
#     for col in range(N):
#         if row < col:
#             print(0, end = ' ')
#         elif row > col:
#             print(2, end = ' ')
#         else:
#             print(1, end = ' ')
#     print()

# Task 2

# for row in range(20):
#     for col in range(50):
#         if col == 24:
#             print('|', end = '')
#         elif col == row + 29:
#             print('\\', end = '')
#         elif col == -row + 19:
#             print('/', end = '')
#         elif row == 9:
#             print('-', end = '')
#         else:
#             print(' ', end = '')
#     print()

# Home Work
# 1 ==========================================================================
'''Задача 1.Врата
Напишите программу, которая выводит в консоль “Врата”, состоящие из тире, вертикальных 
линий и пробелов. Поле состоит из 20 строк и 30 столбцов (но не стесняйтесь пробовать и 
другие размеры)
------------------------------
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
|                            |
'''
# for row in range(20):
#     for col in range(30):
#         if row == 0:
#             print('-', end = '')
#         elif col == 0:
#             print('|', end = '')
#         elif col == 30 - 1:
#             print('|', end = '')
#         else:
#             print(' ', end = '')
#     print()
# 2 ==========================================================================
'''Задача 2. Дорога
Мы делаем текстовую игру - гонку и нам нужно вывести на экран что-то вроде трассы, где 
будут соревноваться наши машины. Напишите программу, которая выводит такую дорогу на 
экран (поле 20 на 50)
                   /    |    \                    
                  /     |     \                   
                 /      |      \                  
                /       |       \                 
               /        |        \                
              /         |         \               
             /          |          \              
            /           |           \             
           /            |            \            
--------------------------------------------------
         /              |              \          
        /               |               \         
       /                |                \        
      /                 |                 \       
     /                  |                  \      
    /                   |                   \     
   /                    |                    \    
  /                     |                     \   
 /                      |                      \  
/                       |                       \ 
'''
# for row in range(20):
#     for col in range(50):
#         if row == 20/2 - 1:
#             print('-', end = '')
#         elif col == row + (30 - 1):
#             print('\\', end = '')
#         elif col == -row + (20 - 1):
#             print('/', end = '')
#         elif col == 50/2 - 1:
#             print('|', end = '')
#         else:
#             print(' ', end = '')
#     print()
# 3 ==========================================================================
'''Задача 3. Диагональная матрица 
Напишите программу, которая получает на вход размер квадратной матрицы и выводит на экран 
по такому принципу: диагональ из единиц с левого нижнего угла до верхнего правого; ниже 
диагонали - двойки, выше  - нули
0 0 0 0 1 
0 0 0 1 2 
0 0 1 2 2 
0 1 2 2 2 
1 2 2 2 2 
'''
N = int(input('Введите размер матрицы: '))
for row in range(N):
    for col in range(N):
        if col == -row + (N-1):
            print(1, end = ' ')
        elif col > -row + (N-1):
            print(2, end = ' ')
        else:
            print(0, end = ' ')
    print()
