# Task 1

# n = int(input('Введите число: '))
# for num in range(n + 1):
#     if num % 2 == 0:
#         print(num,'** 3 = ',num ** 3)

# Task 2

# n = int(input('Введите число: '))
# for num in range(1, n//2 + 1):
#     num = num * 2             # Четное число
#     print(num,'** 3 = ',num ** 3)

# Task 3

# total_hours = int(input('Введите кол-во часов: '))
# sells = 1
# for hour in range(1, total_hours // 3 + 1):
#     sells *= 2
#     print('Прошло часов: ', hour*3)
#     print('Кол-во клеток: ', sells)
#     print('Осталось часов: ', total_hours - hour*3)
#     print()
# print('Наблюдение завершено!')

# Home Work
# 1 ==========================================================================
# n = int(input('Введите число: '))
# for num in range(1, n // 2 + 1):
#     num *= 2
#     print(num,'^ 3 = ', num**3)
# 2 ==========================================================================
# hours = int(input('Введите общее кол-во часов наблюдения: '))
# sells = 1
# for hour in range(1, hours // 3 + 1):
#     hour *= 3
#     sells *= 2
#     print('Прошло', hour, 'часов.')
#     print('Кол-во клеток:', sells)
#     print('До завершения наблюдения', hours - hour, 'часов.')
#     print()
# print('Наблюдение завершено!')
# 3 ==========================================================================
# distance = int(input('Cколько метров нужно проехать? '))
# strength_factor  = 100
# for hour in range(1, distance // 4 + 1):
#     hour *= 4
#     strength_factor -= 5/2
#     print('Валли-Рус прошел', hour,'метров.')
#     print('Ехать еще', distance - hour,'метров.')
#     print('Коэффициент прочности', strength_factor)
#     print()
# 4 ==========================================================================
n = int(input('Введите число: '))
for num in range(1, n // 2  + 1):
    num = num *2 - 1        # Нечетное число
    print(num,'^ 2 =',num**2)
# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================