'''Работа за преподавателем'''
# Task 1
# n = int(input('Введите число: '))
# for num in range(1, n // 2  + 1 + n % 2):
#     num = num *2 - 1        # Нечетное число
#     print(num,'^ 2 =',num**2)

# Task 2
# n = int(input('Введите число: '))
# for num in range(1, n+1, 2):
#     print(num,'^ 2 =',num**2)

# Task 3
# wake_up = int(input('Во сколько проснулся? '))
# water = 0
# calories_sum = 0
# for hour in range(wake_up, 23, 3):
#     water += 1
#     print('Пошли есть в', hour, 'часов.')
#     calories = int(input('Сколько съел? '))
#     calories_sum += calories
# print('Выпито литров воды: ', water)
# print('Съедено калорий: ', calories_sum)

# Home Work
# 1 ==========================================================================
'''Задача 1. Степень нечётного числа
Выведите третью степень каждого нечётного числа в диапазоне от единицы до указанного 
пользователем числа включительно. Для этого используйте шаг внутри функции range.
'''
# n = int(input('Введите число: '))
# for num in range(1, n+1, 2):
#     print(num, '^ 3 = ', num**3)
# 2 ==========================================================================
'''Задача 2. Театр
Ваню заставили пойти в театр на балет. Ему стало там настолько скучно, что он придумал 
себе очень странное развлечение: считать сумму номеров каждого пятого стула в рядах.
Напишите программу для вычисления суммы каждого пятого числа, лежащего в диапазоне от 
единицы до N. Использовать условный оператор нельзя.
Пример:
Введите число: 21
Номер стула: 1
Номер стула: 6
Номер стула: 11
Номер стула: 16
Номер стула: 21
Сумма: 55
'''
# n = int(input('Введите число: '))
# summ = 0
# for num in range(1, n+1, 5):
#     print('Номер стула: ', num)
#     summ += num
# print('Сумма: ', summ)
# 3 ==========================================================================
'''Задача 3. Диета
Саша просыпается когда угодно, но в 23 часа уже точно идёт спать. Питается Саша 
следующим образом: каждые 3 часа он выпивает литр воды и съедает N калорий. Пить 
и есть он, кстати, начинает сразу как только проснётся. Напишите программу, которая 
считает сколько он выпьет литров воды и сколько калорий он съест перед тем как пойдёт спать.
'''
# wake_up = int(input('Во сколько проснулся? '))
# water = 0
# calories_sum = 0
# for hour in range(wake_up, 23, 3):
#     water += 1
#     print('Пошли есть в', hour, 'часов.')
#     calories = int(input('Сколько съел? '))
#     calories_sum += calories
# print('Выпито литров воды: ', water)
# print('Съедено калорий: ', calories_sum)
# 4 ==========================================================================

# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================