# Task 1

# n = int(input('Введите число: '))
# for num in range(1, n // 2  + 1 + n % 2):
#     num = num *2 - 1        # Нечетное число
#     print(num,'^ 2 =',num**2)

# Task 2

# n = int(input('Введите число: '))
# for num in range(1, n+1, 2):
#     print(num,'^ 2 =',num**2)

# Task 2

# wake_up = int(input('Во сколько проснулся? '))
# water = 0
# calories_sum = 0
# for hour in range(wake_up, 23, 3):
#     water += 1
#     print('Пошли есть в', hour, 'часов.')
#     calories = int(input('Сколько съел? '))
#     calories_sum += calories
# print('Выпито литров воды: ', water)
# print('Съедено калорий: ', calories_sum)

# Home Work
# 1 ==========================================================================
# n = int(input('Введите число: '))
# for num in range(1, n+1, 2):
#     print(num, '^ 3 = ', num**3)
# 2 ==========================================================================
# n = int(input('Введите число: '))
# summ = 0
# for num in range(1, n+1, 5):
#     print('Номер стула: ', num)
#     summ += num
# print('Сумма: ', summ)
# 3 ==========================================================================
wake_up = int(input('Во сколько проснулся? '))
water = 0
calories_sum = 0
for hour in range(wake_up, 23, 3):
    water += 1
    print('Пошли есть в', hour, 'часов.')
    calories = int(input('Сколько съел? '))
    calories_sum += calories
print('Выпито литров воды: ', water)
print('Съедено калорий: ', calories_sum)
# 4 ==========================================================================

# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================