# Task 1

# seconds = int(input('Введите кол-во секунд: '))
# for sec in range(seconds, -1, -1):
#     print('Микроволновка греет: ', sec)
# print('Дзынь!')

# Task 2

# totalSoldiers = int(input('Кол-во солдат в ширенге: '))
# total_rules = int(input('Сколько правил в уставе? '))
# push_ups = 0                                                # Push ups Отжимания
# for soldier in range(totalSoldiers, 0, -4):
#     soldier_rules = int(input(str(soldier) + '-й cолдат, назови кол-во правил в уставе:  '))
#     if total_rules != soldier_rules:
#         print('Неправильно!', 10 * soldier, 'отжиманий!')
#         push_ups += 10 * soldier
# print('Общее кол-во отжиманий: ', push_ups)

# Home Work
# 1 ==========================================================================
# seconds = int(input('Сколько считать? '))
# for sec in range(seconds, 0, -1):
#     print(sec)
# print('Я иду искать!')
# 2 ==========================================================================
# totalSoldiers = int(input('Кол-во солдат в ширенге: '))
# push_ups = 0                                                # Push ups Отжимания
# for soldier in range(totalSoldiers - 3, 0, -4):
#     if totalSoldiers >= 4:
#         total_rules = int(input('Сколько правил в уставе? '))
#         soldier_rules = int(input(str(soldier) + '-й cолдат, назови кол-во правил в уставе:  '))
#         if total_rules != soldier_rules:
#             print('Неправильно!', 10 * soldier, 'отжиманий!')
#             push_ups += 10 * soldier
# print('Общее кол-во отжиманий: ', push_ups)
# 3 ==========================================================================
N = int(input('Сколько считать? '))
if N % 2 == 0:
    step = -2
else:
    N -= 1
    step = -2
for sec in range(N, 0, step):
    print(sec)
print('Я иду искать!')
# 4 ==========================================================================

# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================