# Разбор ДЗ
'''Задача 10. НОД
Напишите функцию, вычисляющую наибольший общий делитель двух чисел.
'''
# Реализация алгоритма Евклида (поиск НОД)
# def gcd(a, b):      # greatest common divisor - Наибольший общий делитель (НОД)
#     while a != 0 and b != 0:
#         if a > b:
#             a %= b
#         else:
#             b %= a
#     print('Наибольший общий делитель (НОД) равен: ', a + b)

# gcd(30, 20)
