# Task 1

# x = 1
# for i in range(10000):
#     x /= 2
# print(x)

# x = 1
# for i in range(1, 1075+1):
#     x /= 2
#     print(f'{i}-я итерация: 2^-{i} = {x}')

# x = 1
# count = 0
# while x != 0:
#     x /= 2
#     count += 1
#     print('x =', x)
# print('Итераций:', count)

# x = 1
# count_1 = 0
# count_2 = 0
# while x != 0:
#     x /= 2
#     if x != 0:
#         last_non_zero_value = x
#         count_1 += 1
#     count_2 += 1
#     print(x)
# print(f'Последнее не нулевое значение {last_non_zero_value} достигнуто на {count_1}-ой итерации.')
# print(f'Значение машинного нуля достигнуто на {count_2}-ой итерации.')

# Task 2

# vFirstPlanet = 1.41228e15    # км^3
# vSecondPlanet = 6.254e13    # км^3
# pEarth = 5.5153e12     # кг/км^3

# mFirstPlanet = float(input('Масса первой планеты: '))
# mSecondPlanet = float(input('Масса второй планеты: '))

# pFirstPlanet = mFirstPlanet / vFirstPlanet
# pSecondPlanet = mSecondPlanet / vSecondPlanet
# print('Плотность первой планеты: ', pFirstPlanet)
# print('Плотность второй планеты: ', pSecondPlanet)

# if abs(pEarth - pFirstPlanet) < abs(pEarth - pSecondPlanet):
#     print('Плотность первой планеты ближе к плотности Земли')
# else:
#     print('Плотность второй планеты ближе к плотности Земли')


# Task 3



# Home Work
# 1 ==========================================================================
# count = 0
# num = 1
# while True:
#     num /= 2
#     if num != 0:
#         count += 1
#         min_num = num
#     else:
#         print('Самое маленькое число: ', min_num,'\nКол-во делений: ', count)
#         break
# 2 ==========================================================================
# count = 0
# x = 1
# n = float(input('Введите число в экспоненциальной форме: '))
# while x <= 2:
#     x += n
#     count += 1
# print('Кол-во прибавлений: ', count)
# 3 ==========================================================================
def floating_point_format(num):
    a = num
    b = 0
    while num > 10:
        num /= 10
        b += 1
    print('Формат плавающей точки: ', a * 10 ** -b, '* 10 **', b)


x = float(input('Введите число положительное число > 0: '))
floating_point_format(x)
# 4 ==========================================================================
# Это я просто для себя страницы выводил на печать
# print('='*90)
# count = 1
# page = 1
# while page < 43:
#     if count == 2:
#         count = 0
#         page += 2
#     else:
#         print(page, end = ', ')
#         count += 1
#         page += 1

# print()

# count = 0
# page = 2
# while page < 43:
#     if count == 2:
#         count = 0
#         page += 2
#     else:
#         print(page, end = ', ')
#         count += 1
#         page += 1
# print()
# print('='*90)
# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================