# Task 1

# b = [1, 5, 2, -7, 6]
# for i in range (5):
#     a = int(input('Введите число: '))
#     b.append(a)
# for number in b:
#     print(number, '** 2 =', number ** 2)

# Task 2

# books_ID = [50, 34, -1, -1, 23, -1]
# new_books_ID = []
# returned = 0
#
# for _ in range(10):
#     id = int(input('Введите ID книги: '))
#     books_ID.append(id)
#
# for id in books_ID:
#     if id == -1:
#         returned += 1
#     else:
#         new_books_ID.append(id)
#
# print('Новый список выданных книг: ', new_books_ID)
# print('Вернули за день книг: ', returned)

# Task 3

# Home Work
# 1 ==========================================================================
# numbers = [3, 7, 5]
#
# while True:
#     number = int(input('Новое число: '))
#     numbers.append(number)
#     print('Текущий список чисел: ', numbers, '\n')
#     for i in numbers:
#         print(i ** 2, i ** 3, i ** 4)
#         print()
# 2 ==========================================================================
# numbers = []
#
# for num in range(101):
#     numbers.append(num)
#
# print("Список от 0 до 100: \n", numbers)
# 3 ==========================================================================
number_of_employees = int(input('Введите количество сотрудников: '))     # Количество сотрудников
list_of_employees = []
flag = False

for _ in range(1, number_of_employees + 1):
    id = int(input('ID сотрудника: '))
    list_of_employees.append(id)

ID_find = int(input('Какой ID ищем? '))

for id in list_of_employees:
    if id == ID_find:
        flag = True

if flag == True:
    print("\nСотрудник на месте")
else:
    print("\nСотрудник не работает!")
# 4 ==========================================================================

# 5 ==========================================================================

# 6 ==========================================================================

# 7 ==========================================================================

# 8 ==========================================================================

# 9 ==========================================================================

# 10 ==========================================================================

# 11 ==========================================================================

# 12 ==========================================================================

# 13 ==========================================================================

# 14 ==========================================================================

# 15 ==========================================================================